---
kind: type
id: T:Autodesk.Revit.Exceptions.DirectoryNotEmptyException
source: html/9614b41a-e3ea-eed0-d74d-57337e6f4888.htm
---
# Autodesk.Revit.Exceptions.DirectoryNotEmptyException

The exception that is thrown when a method received a directory as an argument and
requires that the directory be empty but the directory is not empty.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class DirectoryNotEmptyException : ArgumentException
```